# SQL (Structured Query Language)

- DDL (data definition language)
    - create (create new database object)
    - alter (modifying existing database objects)
    - drop (delete existing database onjects)
    - truncate (remove all rows form table)
- DML (data manipulation language)
    - insert (create new rows in tables)
    - update (modify data in tables)
    - delete (delete data from tables)
    - select (retrieve data from tables)
- DCL (data control language)
    - grant (provide access rights on database)
    - revoke (withdraw access rights on database)
- TCL ( transaction control language)
    - commit (save database changes and end transaction)
    - rollback (undo changes that are not committed and end transaction)

# DDL (Data Definition Language)

### DDL for Database

- Create

CREATE DATABASE department

or 

CREATE DATABASE IF NOT EXIST department

- Delete

DROP DATABASE department

or

DROP DATABASE IF EXISTS department

### DDL for Tables

- Create

CREATE TABLE student(
    student_id INTERGER PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR NOT NULL(255),
    age INTEGER NOT NULL,
    email VARCHAR(255) UNIQUE,
    password VARCHAR (255) NOT NULL
    
)

CREATE TABLE student(
    student_id INTERGER NOT NULL,
    name VARCHAR NOT NULL(255),
    age INTEGER NOT NULL,
    email VARCHAR(255),
    password VARCHAR (255) NOT NULL


    CONSTRAINT department_email_unique UNIQUE (email, name)
    
)

the combination of student_id & email is unique.

CREATE TABLE student(
    student_id INTERGER NOT NULL,
    name VARCHAR NOT NULL(255),
    age INTEGER NOT NULL,
    email VARCHAR(255),
    password VARCHAR (255) NOT NULL


    CONSTRAINT department_pk PRIMARY KEY (email, student_id)
    
)

the combination of email & student_id together makes the primary key.

CREATE TABLE student(
    student_id INTERGER NOT NULL,
    name VARCHAR NOT NULL(255),
    age INTEGER NOT NULL CHECK (age>6 AND age<25),
    email VARCHAR(255),
    password VARCHAR (255) NOT NULL


    CONSTRAINT department_age_check CHECK (age>6 AND age<25)
    
)

the check constraint check the condition and takes input accordingly.

CREATE TABLE customers(
    cid INTERGER PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR (255) NOT NULL,
    email VARCHAR (255) NOT NULL UNIQUE
    
)


CREATE TABLE orders(
    orderid INTERGER PRIMARY KEY AUTO_INCREMENT,
    cid INTEGER NOT NULL,
    order_date DATETIME NOT NULL DEFAULT CURRENT_TIMESTAMP

    CONSTRAINT orders_fk FOREIGN KEY (cid) REFERENCES customers (cid)
)

- Truncate

TRUNCATE TABLE student

- Drop

DROP TABLE IF EXISTS student

- Alter

ALTER TABLE customers 
ADD COLUMN password VARCHAR(255) NOT NULL

or

ALTER TABLE customers 
ADD COLUMN surname VARCHAR(255) NOT NULL AFTER name

or

ALTER TABLE customers
DROP COLUMN email
DROP COLUMN name

or

ALTER TABLE customers
MODIFY COLUMN name INTERGER AUTO_INCREMENT

or

ALTER TABLE customer
ADD CONSTRAINT customer_age_check CHECK (age > 30)

# DML (Data Manipulation Language)

- Insert

INSERT INTO db_name.table_name(col1, col2, col3...)
VALUES (val1, val2, val3...)

or

INSERT INTO db_name.table_name
VALUES (val1, val2, val3...)


if we want to insert values in each columns

INSERT INTO db_name.table_name(col_name, col_name)
VALUES (val1, val2)

if we want to insert values in some columns

INSERT INTO db_name.table_name VALUES
(val1, val2, val3....),
(val1, val2, val3....),
(val1, val2, val3....),
(val1, val2, val3....)

if we want to insert values in multiple columns

- Select

SELECT * FROM db_name.table_name;

this is use to select all columns

SELECT col1, col2,... FROM db_name.table_name;

this is used to select only some columns

SELECT col1_old_name AS col1_new_name , col2_old_name AS col2_new_name

this is use to remane a column name called aliasing.

SELECT col1,col2....,
formula for new column we want to create AS new_col_name
FROM db_name.table_name;

here we create a new column and aliasing it

SELECT col1, col2... FROM db_name.table_name;

we can also apply mathematical operations with column names and implement it in table

SELECT col1, value AS col_name FROM db_name.table_name;

here we create a new column with value

SELECT DISTINCT (col_name) AS 'col_new_name'
FROM db_name.table_name;


this is use to retrieve unique items.

SELECT DISTINCT col1, col2..
FROM db_name.table_name;


this is use to retrieve combinations of unique items from different columns.

- Where

SELECT * FROM db_name.table_name
WHERE col_name = 'value'

this is used to retrieve all rows which satisfies where conditions

SELECT * FROM db_name.table_name
WHERE col_name > 'value1' AND col_name < 'value2'

or 

SELECT * FROM db_name.table_name
WHERE col_name BETWEEN value1 AND value2

- Order of Execution
    - FROM
    - JOIN
    - WHERE
    - GROUP BY
    - HAVING
    - SELECT
    - DISTINCT
    - ORDER BY

SELECT * FROM db_name.table_name
WHERE col_name IN (val1, val2, val3...)

or

SELECT * FROM db_name.table_name
WHERE col_name NOT IN (val1, val2, val3...)

- Update

UPDATE db_name.table_name
SET col_name = 'val1'
WHERE col_name = 'val2'

this is use to update single value

or

UPDATE db_name.table_name
SET col1 = val1 , col2 = val2 ......
WHERE col = val

this is use to update multiple value

- Delete

DELETE FROM db_name.table_name
WHERE col_name > val

this is use to delete by single condition

or

DELETE FROM db_name.table_name
WHERE col1 > val1 AND col2 = val2

this is use to delete by multiple conditions

- SQL Functions

SELECT MAX(col_name) FROM db_name.table_name
SELECT MIN(col_name) FROM db_name.table_name

it find maximum/maximum value from a column

SELECT AVG(col_name) FROM db_name.table_name

it find average value of a column

SELECT SUM(col_name) FROM db_name.table_name

it find summation of a column

SELECT COUNT(*) FROM db_name.table_name
WHERE col = val

it find total number of instances of a value

SELECT COUNT(DISTINCT(col_name)) FROM db_name.table_name

it find total number of unique instances of a value

SELECT STD(col_name) FROM db_name.table_name;
SELECT VARIANCE(col_name) FROM db_name.table_name;

it finds standard deviation & variance of a column

- Scaler Function
    - ABS (use for absolute the value)
    - ROUND (make the digits round upto)
    - CEIL (make the value uppper)
    - FLOOR (makes the value lower)

- Order By

SELECT col_name FROM db_name.table_name
WHERE col = val
ORDER BY col DESC LIMIT number

or

SELECT col_name FROM db_name.table_name
WHERE col = val
ORDER BY col DESC LIMIT x , y 

where x means don't give till 0 - x 
where y means give y number of items

SELECT * FROM db_name.table_name
ORDER BY col1 ASC, col2 ASC.....

here we sort the different column at same time by any order

- Group By

SELECT col_name , COUNT(*) AS new_name, AVG(col) AS new_name
FROM db_name.table_name
GROUP BY col_name

we perform any aggregate operation and create column for it as new_name

SELECT col_name , COUNT(*) AS new_name, AVG(col) AS new_name
FROM db_name.table_name
GROUP BY col_name1, col_name2

we perform any aggregate operation and create column for it as new_name and apply group by on multiple column

- Having

SELECT col_name1, col_name2....
FROM db_name.table_name
GROUP BY col_name
HAVING condition

select --> where 
group by --> having

# JOINS

SELECT * FROM db_name.table1_name t1 
CROSS JOIN db_name.table2_name t2

this is cross join

SELECT * FROM db_name.table1_name t1 
INNER JOIN db_name.table2_name t2
ON t1.common_Col = t2.common_col

this is inner join

SELECT * FROM db_name.table1_name t1 
LEFT JOIN db_name.table2_name t2
ON t1.common_Col = t2.common_col

this is left join

SELECT * FROM db_name.table1_name t1 
RIGHT JOIN db_name.table2_name t2
ON t1.common_Col = t2.common_col

this is right join

SELECT * FROM db_name.table1_name t1 
LEFT JOIN db_name.table2_name t2
ON t1.common_Col = t2.common_col
UNION
SELECT * FROM db_name.table1_name t1 
RIGHT JOIN db_name.table2_name t2
ON t1.common_Col = t2.common_col


this is full outer join

SELECT * FROM db_name.table_name t1 
JOIN db_name.table_name t2
ON t1.Col = t2.col
JOIN db_name.table_name t3
ON t1.Col = t2.col

it is use to join multiple tables and it gives every column because of *

SELECT t1.col, t1.col, t2.col, t3.col... FROM db_name.table_name t1 
JOIN db_name.table_name t2
ON t1.Col = t2.col
JOIN db_name.table_name t3
ON t1.Col = t2.col

it is use to join multiple tables and it gives specific column because we mention them

# SUBQUERY

- In SQL, a subquery is a query within another query. 
- It as a SELECT statement that is nested inside another SELECT, INSERT, UPDATE or DELETE statement.
- The subquery is executed first, and its result is then used as a parameter or condition for the outer query.

- types of subqueries
    1. based on the result it returns
        - Scalar subquery
        - Row subquery
        - Table subquery
    2. based on working
        - Independent
        - correlated

query (
    query
)

SELECT * FROM table_name
WHERE col_name = (SELECT aggregate_function(col_name) FROM table_name
                  WHERE col_name = (SELECT aggregate_function(col_name)
                                    FROM table_name))

# WINDOW FUNCTIONS

SELECT *
aggregate function(col_name) OVER(PARTITION BY col_name)
FROM table_name

- RANK()/ DENSE_RANK()/ROW_NUMBER()

SELECT *,
RANK() OVER (PARTITION BY col1 ORDER BY col2 DESC/ASC)
FROM table_name

RANK - 1 1 3 
DENSE_RANK - 1 1 2
ROW_NUMBER - 1 2 3